if UseItem(160) == true then goto label0 end;
    do return end;
::label0::
    Talk(0, "Huh! Tại sao những dòng chữ lại xuất hiện và những gì được viết ra... "Thành Thành Quyết"...đằng sau bức tượng Phật ở chính điện của chùa Thiên Ninh ở phía nam thành phố Giang Lăng...", "talkname0", 1);
    ModifyEvent(-2, -2, -2, -2, -2, 604, -1, -2, -2, -2, -2, -2, -2);
    ModifyEvent(63, 1, 1, 1, -1, -1, -1, 6768, 6768, 6768, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 2, 1, 1, -1, -1, -1, 6768, 6768, 6768, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 3, 1, 1, -1, -1, -1, 6766, 6766, 6766, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 4, 1, 1, -1, -1, -1, 6766, 6766, 6766, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 5, 1, 1, -1, -1, -1, 6770, 6770, 6770, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 6, 1, 1, -1, -1, -1, 6770, 6770, 6770, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 7, 1, 1, -1, -1, -1, 6772, 6772, 6772, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 8, 1, 1, -1, -1, -1, 6772, 6772, 6772, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 9, 1, 1, -1, -1, -1, 6780, 6780, 6780, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 10, 1, 1, -1, -1, -1, 6780, 6780, 6780, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 11, 1, 1, -1, -1, -1, 6780, 6780, 6780, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 12, 1, 1, -1, -1, -1, 5222, 5222, 5222, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 13, 1, 1, -1, -1, -1, 5222, 5222, 5222, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 14, 1, 1, -1, -1, -1, 5222, 5222, 5222, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 15, 1, 1, -1, -1, -1, 5222, 5222, 5222, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 16, 1, 1, -1, -1, -1, 6778, 6778, 6778, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
	jyx2_ReplaceSceneObject("63", "NPC/各派弟子", "1");
    ModifyEvent(63, 17, 0, 0, -1, -1, 606, -1, -1, -1, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本
    ModifyEvent(63, 18, 0, 0, 644, -1, -1, -1, -1, -1, -2, -2, -2);--by fanyu|场景06-编号00。在天宁寺（场景63）生成一批敌人，进入天宁寺后启动606脚本，战斗胜利后启动644脚本
    jyx2_ReplaceSceneObject("63", "Dynamic/Book", "1");--天宁寺出现
do return end;
